Repository: ladj82/pos-advertising-printer
Catalog: PrintPDV.LanguagePack/AppStrings.*.resx
Languages: pt_br

# ErrorMessage_AppLicense_Required_Activation
source: Field "Activation" must be informed.
pt_br: O campo "Ativação" precisa ser informado.

# ErrorMessage_AppLicense_Required_Identifier
source: Field "Identifier" must be informed.
pt_br: O campo "Identificador" precisa ser informado.

# ErrorMessage_AppLicense_Required_Key
source: Field "Key" must be informed.
pt_br: O campo "Chave" precisa ser informado.

# ErrorMessage_AppLicense_Required_PrintLimit
source: Field "PrintLimit" must be informed.
pt_br: O campo "Limite de impressões" precisa ser informado.

# ErrorMessage_AppLicense_StringLength_Identifier
source: Field "Identifier" must be less or equal to 50 characters lenght.
pt_br: O campo "Identificador" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_AppLicense_StringLength_Key
source: Field "Key" must be 6 characters lenght.
pt_br: O campo "Chave" deve possuir 6 caracteres.

# ErrorMessage_Campaign_Rule_UniqueName
source: Campaign field "Name" must be unique.
pt_br: Já existe uma campanha com o mesmo nome. Escolha outro.

# ErrorMessage_Campaign_Range_BorderWidth
source: Field "BorderWidth" must be less or equal to 100.
pt_br: O campo "Espessura da borda" deve ser menor ou igual a 100.

# ErrorMessage_Campaign_Required_Active
source: Field "Active" must be informed.
pt_br: O campo "Ativo" precisa ser informado.

# ErrorMessage_Campaign_Required_Created
source: Field "Created" must be informed.
pt_br: O campo "Criado" precisa ser informado.

# ErrorMessage_Campaign_Required_CutType
source: Field "CutType" must be informed.
pt_br: O campo "Tipo de corte" precisa ser informado.

# ErrorMessage_Campaign_Required_Name
source: Field "Name" must be informed.
pt_br: O campo "Nome" precisa ser informado.

# ErrorMessage_Campaign_Required_PaperSize
source: Field "PaperSize" must be informed.
pt_br: O campo "Tamanho do papel" precisa ser informado.

# ErrorMessage_Campaign_Required_PrintDateTime
source: Field "PrintDateTime" must be informed.
pt_br: O campo "Iprimir Data e Hora" precisa ser informado.

# ErrorMessage_Campaign_Required_PrintVoucher
source: Field "PrintVoucher" must be informed.
pt_br: O campo "Imprimir Cupom" precisa ser informado.

# ErrorMessage_Campaign_Required_VoucherBarcodeType
source: Field "VoucherBarcodeType" must be informed.
pt_br: O campo "Tipo de código de barras" precisa ser informado.

# ErrorMessage_Campaign_StringLength_BorderStyle
source: Field "BorderStyle" must be less or equal to 20 characters lenght.
pt_br: O campo "Estilo de borda" deve ser menor ou igual a 20 caracteres.

# ErrorMessage_Campaign_StringLength_Name
source: Field "Name" must be less or equal to 50 characters lenght.
pt_br: O campo "Nome" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_Campaign_StringLength_Shortcut
source: Field "Shortcut" must be less or equal to 10 characters lenght.
pt_br: O campo "Atalho" deve ser menor ou igual a 10 caracteres.

# ErrorMessage_GalleryClipart_Required_GalleryType
source: Field "GalleryType" must be informed.
pt_br: O campo "Tipo de Galeria" precisa ser informado.

# ErrorMessage_GalleryClipart_Required_Image
source: Field "Image" must be informed.
pt_br: O campo "Imagem" precisa ser informado.

# ErrorMessage_GalleryClipart_Required_Name
source: Field "Name" must be informed.
pt_br: O campo "Nome" precisa ser informado.

# ErrorMessage_GalleryClipart_StringLength_Name
source: Field "Name" must be less or equal to 50 characters lenght.
pt_br: O campo "Nome" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_License_Rule_Expired
source: License expired.
pt_br: Licença expirada.

# ErrorMessage_License_Rule_NotFound
source: License not found.
pt_br: Licença não encontrada.

# ErrorMessage_License_Rule_NotValid
source: License not valid.
pt_br: Licença inválida.

# ErrorMessage_Printer_Required_ConnectionType
source: Field "ConnectionType" must be informed.
pt_br: O campo "Tipo de conexão" precisa ser informado.

# ErrorMessage_Printer_Required_Manufacturer
source: Field "Manufacturer" must be informed.
pt_br: O campo "Fabricante" precisa ser informado.

# ErrorMessage_Printer_Required_Model
source: Field "Model" must be informed.
pt_br: O campo "Modelo" precisa ser informado.

# ErrorMessage_Printer_Required_Name
source: Field "Name" must be informed.
pt_br: O campo "Nome" precisa ser informado.

# ErrorMessage_Printer_StringLength_IpAddress
source: Field "IpAddress" must be less or equal to 50 characters lenght.
pt_br: O campo "Endereço de rede" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_Printer_StringLength_Manufacturer
source: Field "Manufacturer" must be less or equal to 50 characters lenght.
pt_br: O campo "Fabricante" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_Printer_StringLength_Model
source: Field "Model" must be less or equal to 50 characters lenght.
pt_br: O campo "Modelo" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_Printer_StringLength_Name
source: Field "Name" must be less or equal to 50 characters lenght.
pt_br: O campo "Nome" deve ser menor ou igual a 50 caracteres.

# ErrorMessage_Statistic_Required_CampaignType
source: Field "CampaignType" must be informed.
pt_br: O campo "Tipo de campanha" precisa ser informado.

# ErrorMessage_Statistic_Required_License
source: Field "License" must be informed.
pt_br: O campo "Licença" precisa ser informado.

# ErrorMessage_Statistic_Required_PrintTrigger
source: Field "PrintTrigger" must be informed.
pt_br: O campo "Gatilho de impressão" precisa ser informado.

# ErrorMessage_Statistic_Required_TimeStamp
source: Field "TimeStamp" must be informed.
pt_br: O campo "TimeStamp" precisa ser informado.

# ErrorMessage_Statistic_StringLength_License
source: Field "License" must be 6 characters lenght.
pt_br: O campo "Licença" deve ser 6 caracteres.

# ErrorMessage_Voucher_Rule_AlreadyUsed
source: Voucher already used.
pt_br: Cupom já utilizado.

# ErrorMessage_Voucher_Rule_NotFound
source: Voucher not found.
pt_br: Cupom não encontrado.

# ErrorMessage_Voucher_Required_BarcodeType
source: Field "BarcodeType" must be informed.
pt_br: O campo "Tipo de código de barras" precisa ser informado.

# ErrorMessage_Voucher_Required_Campaign_Id
source: Field "CampaignId" must be informed.
pt_br: O campo "Campanha" precisa ser informado.

# ErrorMessage_Voucher_Required_Code
source: Field "Code" must be informed.
pt_br: O campo "Chave" precisa ser informado.

# ErrorMessage_Voucher_Required_Created
source: Field "Created" must be informed.
pt_br: O campo "Data de criação" precisa ser informado.

# ErrorMessage_Voucher_StringLength_Code
source: Field "Code" must be 7 characters lenght.
pt_br: O campo "Chave" deve possuir 7 caracteres.

# Application_ErrorMessage_DatabaseNotFound
source: Database file not found.
pt_br: Banco de dados não encontrado.

# Generic_Button_Delete
source: Delete
pt_br: Excluir

# Generic_Button_Edit
source: Edit
pt_br: Editar

# Generic_ClassName_AppLicense
source: License
pt_br: Licença

# Generic_ClassName_Campaign
source: Campaign
pt_br: Campanha

# Generic_ClassName_GalleryClipart
source: Gallery Clipart
pt_br: Galeria de Imagens

# Generic_ClassName_GalleryTemplate
source: Gallery Template
pt_br: Galeria de Template

# Generic_ClassName_Printer
source: Printer
pt_br: Impressora

# Generic_ClassName_Statistic
source: Statistic
pt_br: Estatística

# Generic_ClassName_Voucher
source: Voucher
pt_br: Cupom

# Generic_ErrorMessage_Delete
source: Error while deleting "{0}".
pt_br: Erro durante a exclusão "{0}".

# Generic_ErrorMessage_Insert
source: Error while inserting "{0}".
pt_br: Erro durante a inserção "{0}".

# Generic_ErrorMessage_Read
source: Error while reading "{0}".
pt_br: Erro durante a leitura "{0}".

# Generic_ErrorMessage_Save
source: Error while saving "{0}".
pt_br: Erro ao salvar "{0}".

# Generic_ErrorMessage_Update
source: Error while updating "{0}".
pt_br: Erro durante a atualização "{0}".

# Generic_Menu_SysTray_Exit
source: Exit
pt_br: Sair

# Generic_Menu_SysTray_Open
source: Open
pt_br: Abrir

# Generic_MessageBox_ConfirmYesOrNo
source: Do you confirm the action?
pt_br: Você confirma a ação?

# Generic_MessageBox_ErrorTitle
source: Error!
pt_br: Erro!

# Generic_MessageBox_InformationTitle
source: Information!
pt_br: Informação!

# Generic_MessageBox_WarningTitle
source: Warning!
pt_br: Aviso!

# ErrorMessage_Printer_Rule_PrinterNotDefined
source: A printer must be defined.
pt_br: Uma impressora deve ser definida.

# Generic_Label_Disabled
source: Disabled
pt_br: Desativado

# Generic_Label_Enabled
source: Enabled
pt_br: Ativado

# Generic_Label_Images
source: Images
pt_br: Imagens

# Generic_Label_IpAddress
source: IP Address
pt_br: Endereço de Rede

# Generic_Label_Name
source: Name
pt_br: Nome

# Generic_Label_PrintsLeft
source: {0} prints left.
pt_br: {0} impressões restantes.

# Generic_Label_Type
source: Type
pt_br: Tipo

# Generic_MessageBox_ConfirmYesOrNoTitle
source: Yes or No?
pt_br: Sim ou Não?

# Generic_SuccessMessage_Delete
source: Record deleted successfully.
pt_br: Registro excluído com sucesso.

# Generic_SuccessMessage_Save
source: Record saved successfully.
pt_br: Registro salvo com sucesso.

# InfoMessage_Campaign_Rule_NoActiveCampaign
source: There is no active Campaigns found to be printed.
pt_br: Não há Campanhas ativas para serem impressas.

# Application_ErrorMessage_FolderNotCreated
source: Error while creating folder "{0}".
pt_br: Erro a criar a pasta "{0}".

# InfoMessage_Printer_Rule_PrinterNotFound
source: Any compatible printer was found. Check the list of compatible printers on the right. Please install one and click "Reload" button.
pt_br: Nenhuma impressora compatível foi encontrada. Verifique a lista de impressoras compatíveis ao lado. Por favor instale uma e clique no botão "Recarregar".

# ErrorMessage_Statistic_Required_Action
source: Field "Action" must be informed.
pt_br: O campo "Ação" precisa ser informado.

# ErrorMessage_Statistic_Required_Value
source: Field "Value" must be informed.
pt_br: O campo "Valor" precisa ser informado.

# ErrorMessage_Printer_Rule_PrinterHandlerNotResolved
source: The printer handler was not resolved.
pt_br: O gerenciador de impressão não foi resolvido.

# ErrorMessage_Printer_Required_PrinterNotSelected
source: Field "Printer" must be informed.
pt_br: O campo "Impressora" deve ser informado.

# ErrorMessage_GalleryClipart_Required_NotSelected
source: A clipart must be selected.
pt_br: Uma imagem deve ser selecionada.

# ErrorMessage_GalleryTemplate_Required_NotSelected
source: A template must be selected.
pt_br: Um modelo deve ser selecionado.

# InfoMessage_Printer_Info_PrintTestPage
source: Congratulations, your printer works fine!
pt_br: Parabéns, teste realizado com sucesso!

# ErrorMessage_Statistic_Rule_SyncError
source: Error while syncronizing data.
pt_br: Erro durante a sincronização de dados.

# ErrorMessage_AppLicense_Required_Active
source: Field "Active" must be informed.
pt_br: O campo "Ativo" precisa ser informado.
